import { PackageItem } from '../components/front/packageFront/PackageData';

export const packages: PackageItem[] = [
  {
    id: "1",
    title: "Weekly Veggie Bundle",
    price: 49.99,
    originalPrice: 80.00,
    description: "Fresh vegetables delivered weekly",
    image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/veg.png",
    items: [
      {
        id: "3",
        name: "עוגת שוקולד",
        price: 19.9,
        originalPrice: 24.9,
        isSale: true,
        isHot: true,
        image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/chocolate-cake.png",
        description: "הטעם המוכר והאהוב של ערגליות תפוחים חוזר ומפנק בכל ביס. שילוב מדויק של בצק רך ונעים למגע, עם מילוי עשיר ועסיסי של תפוחים טריים שמתפוצצים בטעם טבעי ומתוק. המוצר המושלם להפסקת קפה מרגיעה, לנשנוש קל באמצע היום או כפינוק משפחתי שמשאיר את כולם מרוצים. ערגליות התפוחים מיוצרות בקפידה, תוך שימוש במרכיבים איכותיים בלבד, כדי להבטיח טעם בלתי נשכח ומרקם שמרגיש כמו בבית. כל ביס מלא בניחוח המוכר של תפוחים אפויים, עם איזון מושלם בין המתיקות של המילוי לרכות הבצק.",
        shortDescription: "ערגליות תפוחים קלאסיות עם מילוי עשיר של תפוחים מתוקים וטעימים בבצק רך ונימוח. מתאימות לכל רגע ביום – כנשנוש עם הקפה, בתיק לדרך או כפינוק מתוק לכל המשפחה.",
        productDetails: "מילוי עשיר: תפוחים מובחרים במרקם קרמי וטעם משגע.בצק רך: אפוי במדויק ליצירת מרקם מושלם. ללא חומרים משמרים: עשויות מרכיבים איכותיים בלבד.",
        categories: ["פירות וירקות", "חטיפים ושימורים", "דגנים ופסטה", "קפה ותה", "תבלינים", "שמנים ורטבים", "מאפיה קמח וממתקים", "מוצרי מזון", "מועדפים"],
        tags: ["בריאות", "טבעוני", "אורגני"],
        thumbnails: [
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-1.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-2.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-3.png"
        ],
        sku: "AVO003",
      },
      {
        id: "2",
        name: "חלב",
        price: 8.9,
        originalPrice: null,
        isSale: false,
        isHot: false,
        image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/milk.png",
        description: "הטעם המוכר והאהוב של ערגליות תפוחים חוזר ומפנק בכל ביס. שילוב מדויק של בצק רך ונעים למגע, עם מילוי עשיר ועסיסי של תפוחים טריים שמתפוצצים בטעם טבעי ומתוק. המוצר המושלם להפסקת קפה מרגיעה, לנשנוש קל באמצע היום או כפינוק משפחתי שמשאיר את כולם מרוצים. ערגליות התפוחים מיוצרות בקפידה, תוך שימוש במרכיבים איכותיים בלבד, כדי להבטיח טעם בלתי נשכח ומרקם שמרגיש כמו בבית. כל ביס מלא בניחוח המוכר של תפוחים אפויים, עם איזון מושלם בין המתיקות של המילוי לרכות הבצק.",
        shortDescription: "ערגליות תפוחים קלאסיות עם מילוי עשיר של תפוחים מתוקים וטעימים בבצק רך ונימוח. מתאימות לכל רגע ביום – כנשנוש עם הקפה, בתיק לדרך או כפינוק מתוק לכל המשפחה.",
        productDetails: "מילוי עשיר: תפוחים מובחרים במרקם קרמי וטעם משגע.בצק רך: אפוי במדויק ליצירת מרקם מושלם. ללא חומרים משמרים: עשויות מרכיבים איכותיים בלבד.",
        categories: ["פירות וירקות", "חטיפים ושימורים", "דגנים ופסטה", "קפה ותה", "תבלינים", "שמנים ורטבים", "מאפיה קמח וממתקים", "מוצרי מזון", "מועדפים"],
        tags: ["בריאות", "טבעוני", "אורגני"],
        thumbnails: [
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-1.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-2.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-3.png"
        ],
        sku: "AVO002",
      }
    ],
    isFavorite: false,
    isSale: true
  },
  {
    id: "2",
    title: "Fruit Mix Package",
    price: 39.99,
    originalPrice: 65.00,
    description: "Assorted fresh fruits",
    image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/fruits.png",
    items: [
      {
        id: "3",
        name: "עוגת שוקולד",
        price: 19.9,
        originalPrice: 24.9,
        isSale: true,
        isHot: true,
        image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/chocolate-cake.png",
        description: "הטעם המוכר והאהוב של ערגליות תפוחים חוזר ומפנק בכל ביס. שילוב מדויק של בצק רך ונעים למגע, עם מילוי עשיר ועסיסי של תפוחים טריים שמתפוצצים בטעם טבעי ומתוק. המוצר המושלם להפסקת קפה מרגיעה, לנשנוש קל באמצע היום או כפינוק משפחתי שמשאיר את כולם מרוצים. ערגליות התפוחים מיוצרות בקפידה, תוך שימוש במרכיבים איכותיים בלבד, כדי להבטיח טעם בלתי נשכח ומרקם שמרגיש כמו בבית. כל ביס מלא בניחוח המוכר של תפוחים אפויים, עם איזון מושלם בין המתיקות של המילוי לרכות הבצק.",
        shortDescription: "ערגליות תפוחים קלאסיות עם מילוי עשיר של תפוחים מתוקים וטעימים בבצק רך ונימוח. מתאימות לכל רגע ביום – כנשנוש עם הקפה, בתיק לדרך או כפינוק מתוק לכל המשפחה.",
        productDetails: "מילוי עשיר: תפוחים מובחרים במרקם קרמי וטעם משגע.בצק רך: אפוי במדויק ליצירת מרקם מושלם. ללא חומרים משמרים: עשויות מרכיבים איכותיים בלבד.",
        categories: ["פירות וירקות", "חטיפים ושימורים", "דגנים ופסטה", "קפה ותה", "תבלינים", "שמנים ורטבים", "מאפיה קמח וממתקים", "מוצרי מזון", "מועדפים"],
        tags: ["בריאות", "טבעוני", "אורגני"],
        thumbnails: [
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-1.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-2.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-3.png"
        ],
        sku: "AVO003",
      },
      {
        id: "2",
        name: "חלב",
        price: 8.9,
        originalPrice: null,
        isSale: false,
        isHot: false,
        image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/milk.png",
        description: "הטעם המוכר והאהוב של ערגליות תפוחים חוזר ומפנק בכל ביס. שילוב מדויק של בצק רך ונעים למגע, עם מילוי עשיר ועסיסי של תפוחים טריים שמתפוצצים בטעם טבעי ומתוק. המוצר המושלם להפסקת קפה מרגיעה, לנשנוש קל באמצע היום או כפינוק משפחתי שמשאיר את כולם מרוצים. ערגליות התפוחים מיוצרות בקפידה, תוך שימוש במרכיבים איכותיים בלבד, כדי להבטיח טעם בלתי נשכח ומרקם שמרגיש כמו בבית. כל ביס מלא בניחוח המוכר של תפוחים אפויים, עם איזון מושלם בין המתיקות של המילוי לרכות הבצק.",
        shortDescription: "ערגליות תפוחים קלאסיות עם מילוי עשיר של תפוחים מתוקים וטעימים בבצק רך ונימוח. מתאימות לכל רגע ביום – כנשנוש עם הקפה, בתיק לדרך או כפינוק מתוק לכל המשפחה.",
        productDetails: "מילוי עשיר: תפוחים מובחרים במרקם קרמי וטעם משגע.בצק רך: אפוי במדויק ליצירת מרקם מושלם. ללא חומרים משמרים: עשויות מרכיבים איכותיים בלבד.",
        categories: ["פירות וירקות", "חטיפים ושימורים", "דגנים ופסטה", "קפה ותה", "תבלינים", "שמנים ורטבים", "מאפיה קמח וממתקים", "מוצרי מזון", "מועדפים"],
        tags: ["בריאות", "טבעוני", "אורגני"],
        thumbnails: [
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-1.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-2.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-3.png"
        ],
        sku: "AVO002",
      }
    ],
    isFavorite: false,
    isSale: false
  },
  {
    id: "3",
    title: "Dairy Package",
    price: 29.99,
    originalPrice: 45.00,
    description: "Fresh dairy products",
    image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/dairy.png",
    items: [
      {
        id: "3",
        name: "עוגת שוקולד",
        price: 19.9,
        originalPrice: 24.9,
        isSale: true,
        isHot: true,
        image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/chocolate-cake.png",
        description: "הטעם המוכר והאהוב של ערגליות תפוחים חוזר ומפנק בכל ביס. שילוב מדויק של בצק רך ונעים למגע, עם מילוי עשיר ועסיסי של תפוחים טריים שמתפוצצים בטעם טבעי ומתוק. המוצר המושלם להפסקת קפה מרגיעה, לנשנוש קל באמצע היום או כפינוק משפחתי שמשאיר את כולם מרוצים. ערגליות התפוחים מיוצרות בקפידה, תוך שימוש במרכיבים איכותיים בלבד, כדי להבטיח טעם בלתי נשכח ומרקם שמרגיש כמו בבית. כל ביס מלא בניחוח המוכר של תפוחים אפויים, עם איזון מושלם בין המתיקות של המילוי לרכות הבצק.",
        shortDescription: "ערגליות תפוחים קלאסיות עם מילוי עשיר של תפוחים מתוקים וטעימים בבצק רך ונימוח. מתאימות לכל רגע ביום – כנשנוש עם הקפה, בתיק לדרך או כפינוק מתוק לכל המשפחה.",
        productDetails: "מילוי עשיר: תפוחים מובחרים במרקם קרמי וטעם משגע.בצק רך: אפוי במדויק ליצירת מרקם מושלם. ללא חומרים משמרים: עשויות מרכיבים איכותיים בלבד.",
        categories: ["פירות וירקות", "חטיפים ושימורים", "דגנים ופסטה", "קפה ותה", "תבלינים", "שמנים ורטבים", "מאפיה קמח וממתקים", "מוצרי מזון", "מועדפים"],
        tags: ["בריאות", "טבעוני", "אורגני"],
        thumbnails: [
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-1.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-2.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-3.png"
        ],
        sku: "AVO003",
      },
      {
        id: "2",
        name: "חלב",
        price: 8.9,
        originalPrice: null,
        isSale: false,
        isHot: false,
        image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/milk.png",
        description: "הטעם המוכר והאהוב של ערגליות תפוחים חוזר ומפנק בכל ביס. שילוב מדויק של בצק רך ונעים למגע, עם מילוי עשיר ועסיסי של תפוחים טריים שמתפוצצים בטעם טבעי ומתוק. המוצר המושלם להפסקת קפה מרגיעה, לנשנוש קל באמצע היום או כפינוק משפחתי שמשאיר את כולם מרוצים. ערגליות התפוחים מיוצרות בקפידה, תוך שימוש במרכיבים איכותיים בלבד, כדי להבטיח טעם בלתי נשכח ומרקם שמרגיש כמו בבית. כל ביס מלא בניחוח המוכר של תפוחים אפויים, עם איזון מושלם בין המתיקות של המילוי לרכות הבצק.",
        shortDescription: "ערגליות תפוחים קלאסיות עם מילוי עשיר של תפוחים מתוקים וטעימים בבצק רך ונימוח. מתאימות לכל רגע ביום – כנשנוש עם הקפה, בתיק לדרך או כפינוק מתוק לכל המשפחה.",
        productDetails: "מילוי עשיר: תפוחים מובחרים במרקם קרמי וטעם משגע.בצק רך: אפוי במדויק ליצירת מרקם מושלם. ללא חומרים משמרים: עשויות מרכיבים איכותיים בלבד.",
        categories: ["פירות וירקות", "חטיפים ושימורים", "דגנים ופסטה", "קפה ותה", "תבלינים", "שמנים ורטבים", "מאפיה קמח וממתקים", "מוצרי מזון", "מועדפים"],
        tags: ["בריאות", "טבעוני", "אורגני"],
        thumbnails: [
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-1.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-2.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-3.png"
        ],
        sku: "AVO002",
      }
    ],
    isFavorite: false,
    isSale: true
  },
  {
    id: "4",
    title: "Bakery Package",
    price: 19.99,
    originalPrice: 35.00,
    description: "Fresh baked goods",
    image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/bread.png",
    items: [
      {
        id: "3",
        name: "עוגת שוקולד",
        price: 19.9,
        originalPrice: 24.9,
        isSale: true,
        isHot: true,
        image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/chocolate-cake.png",
        description: "הטעם המוכר והאהוב של ערגליות תפוחים חוזר ומפנק בכל ביס. שילוב מדויק של בצק רך ונעים למגע, עם מילוי עשיר ועסיסי של תפוחים טריים שמתפוצצים בטעם טבעי ומתוק. המוצר המושלם להפסקת קפה מרגיעה, לנשנוש קל באמצע היום או כפינוק משפחתי שמשאיר את כולם מרוצים. ערגליות התפוחים מיוצרות בקפידה, תוך שימוש במרכיבים איכותיים בלבד, כדי להבטיח טעם בלתי נשכח ומרקם שמרגיש כמו בבית. כל ביס מלא בניחוח המוכר של תפוחים אפויים, עם איזון מושלם בין המתיקות של המילוי לרכות הבצק.",
        shortDescription: "ערגליות תפוחים קלאסיות עם מילוי עשיר של תפוחים מתוקים וטעימים בבצק רך ונימוח. מתאימות לכל רגע ביום – כנשנוש עם הקפה, בתיק לדרך או כפינוק מתוק לכל המשפחה.",
        productDetails: "מילוי עשיר: תפוחים מובחרים במרקם קרמי וטעם משגע.בצק רך: אפוי במדויק ליצירת מרקם מושלם. ללא חומרים משמרים: עשויות מרכיבים איכותיים בלבד.",
        categories: ["פירות וירקות", "חטיפים ושימורים", "דגנים ופסטה", "קפה ותה", "תבלינים", "שמנים ורטבים", "מאפיה קמח וממתקים", "מוצרי מזון", "מועדפים"],
        tags: ["בריאות", "טבעוני", "אורגני"],
        thumbnails: [
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-1.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-2.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-3.png"
        ],
        sku: "AVO003",
      },
      {
        id: "2",
        name: "חלב",
        price: 8.9,
        originalPrice: null,
        isSale: false,
        isHot: false,
        image: "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/milk.png",
        description: "הטעם המוכר והאהוב של ערגליות תפוחים חוזר ומפנק בכל ביס. שילוב מדויק של בצק רך ונעים למגע, עם מילוי עשיר ועסיסי של תפוחים טריים שמתפוצצים בטעם טבעי ומתוק. המוצר המושלם להפסקת קפה מרגיעה, לנשנוש קל באמצע היום או כפינוק משפחתי שמשאיר את כולם מרוצים. ערגליות התפוחים מיוצרות בקפידה, תוך שימוש במרכיבים איכותיים בלבד, כדי להבטיח טעם בלתי נשכח ומרקם שמרגיש כמו בבית. כל ביס מלא בניחוח המוכר של תפוחים אפויים, עם איזון מושלם בין המתיקות של המילוי לרכות הבצק.",
        shortDescription: "ערגליות תפוחים קלאסיות עם מילוי עשיר של תפוחים מתוקים וטעימים בבצק רך ונימוח. מתאימות לכל רגע ביום – כנשנוש עם הקפה, בתיק לדרך או כפינוק מתוק לכל המשפחה.",
        productDetails: "מילוי עשיר: תפוחים מובחרים במרקם קרמי וטעם משגע.בצק רך: אפוי במדויק ליצירת מרקם מושלם. ללא חומרים משמרים: עשויות מרכיבים איכותיים בלבד.",
        categories: ["פירות וירקות", "חטיפים ושימורים", "דגנים ופסטה", "קפה ותה", "תבלינים", "שמנים ורטבים", "מאפיה קמח וממתקים", "מוצרי מזון", "מועדפים"],
        tags: ["בריאות", "טבעוני", "אורגני"],
        thumbnails: [
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-1.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-2.png",
          "https://pub-e320cbb58ef047df8774a8d4068ef39f.r2.dev/avocado-3.png"
        ],
        sku: "AVO002",
      }
    ],
    isFavorite: false,
    isSale: false
  }
];
